---
title: ViewDisplayDepthCueing
classe: Autodesk.Revit.DB.ViewDisplayDepthCueing
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# ViewDisplayDepthCueing

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean EnableDepthCueing { get; set; }` | `viewDisplayDepthCueing.EnableDepthCueing` | Boolean |
| `Int32 EndPercentage { get; }` | `viewDisplayDepthCueing.EndPercentage` | Int32 |
| `Int32 FadeTo { get; set; }` | `viewDisplayDepthCueing.FadeTo` | Int32 |
| `Boolean IsValidObject { get; }` | `viewDisplayDepthCueing.IsValidObject` | Boolean |
| `Int32 StartPercentage { get; }` | `viewDisplayDepthCueing.StartPercentage` | Int32 |
| `Void Dispose()` | `viewDisplayDepthCueing.Dispose()` | Void |
| `Void SetStartEndPercentages(Int32, Int32)` | `viewDisplayDepthCueing.SetStartEndPercentages(startPercentage, endPercentage)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```